app/Controllers/BookingController.php

SELECT *
FROM `shops`
WHERE `is_active` = 1
---
    public function getShops()
    {
        try {
            $db = \Config\Database::connect();
            $shops = $db->table('shops')
                       ->where('is_active', 1)
                       ->get()
                       ->getResultArray();

SELECT `a`.*, `u`.`first_name`, `u`.`last_name`, `s`.`service_name`, `s`.`price`, `s`.`duration`, `sh`.`shop_name`
FROM `appointments` `a`
JOIN `users` `u` ON `u`.`user_id` = `a`.`barber_id`
JOIN `services` `s` ON `s`.`service_id` = `a`.`service_id`
JOIN `shops` `sh` ON `sh`.`shop_id` = `a`.`shop_id`
WHERE `a`.`customer_id` = '1'
ORDER BY `a`.`appointment_date` DESC, `a`.`appointment_time` DESC
---
    public function getMyAppointments()
    {
        if (!session()->get('user_id')) {
            return $this->response->setJSON(['error' => 'Unauthorized']);
        }

        $userId = session()->get('user_id');

        try {
            $db = \Config\Database::connect();
            $appointments = $db->table('appointments a')
                             ->select('
                                 a.*,
                                 u.first_name, u.last_name,
                                 s.service_name, s.price, s.duration,
                                 sh.shop_name
                             ')
                             ->join('users u', 'u.user_id = a.barber_id')
                             ->join('services s', 's.service_id = a.service_id')
                             ->join('shops sh', 'sh.shop_id = a.shop_id')
                             ->where('a.customer_id', $userId)
                             ->orderBy('a.appointment_date', 'DESC')
                             ->orderBy('a.appointment_time', 'DESC')
                             ->get()
                             ->getResultArray();