app/Controllers/SocialFeedController.php

    public function index()
    {
        $posts = $this->socialFeedModel->getPublicFeed();
        // Attach DB image URLs for each post
        foreach ($posts as &$post) {
            $imageRows = $this->socialFeedImageModel
                ->where('post_id', (int) ($post['post_id'] ?? 0))
                ->orderBy('sort_order', 'ASC')
                ->findAll();
            $post['image_urls'] = array_map(fn($row) => base_url('social-feed/image/' . $row['image_id']), $imageRows);
            $post['comments_count'] = $this->socialFeedCommentModel
                ->where('post_id', (int) ($post['post_id'] ?? 0))
                ->countAllResults();
---
SELECT *
FROM `social_feed_images`
WHERE `post_id` = 9
ORDER BY `sort_order` ASC
SELECT COUNT(*) AS `numrows`
FROM `social_feed_comments`
WHERE `post_id` = 9

    public function userPosts($userId)
    {
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'