app/Models/MessageModel.php

SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `receiver_id` = '1'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('receiver_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();