app/Models/ShopModel.php

    public function getActiveShops()
    {
        return $this->where('is_active', 1)->findAll();
---
SELECT *
FROM `shops`
WHERE `is_active` = 1