app/Models/SocialFeedModel.php

SELECT `social_feed`.*, `users`.`first_name`, `users`.`last_name`, `users`.`profile_picture` AS `profile_picture`
FROM `social_feed`
LEFT JOIN `users` ON `users`.`user_id` = `social_feed`.`user_id`
WHERE `is_public` = 1
ORDER BY `social_feed`.`created_at` DESC
 LIMIT 20
---
    public function getPublicFeed($limit = 20)
    {
        return $this->select('social_feed.*, users.first_name, users.last_name, users.profile_picture AS profile_picture')
                    ->join('users', 'users.user_id = social_feed.user_id', 'left')
                    ->where('is_public', 1)
                    ->orderBy('social_feed.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT *
FROM `social_feed`
WHERE `social_feed`.`post_id` = '9'
---
    public function getPostWithDetails($postId)
    {
        return $this->find($postId);