app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `role` = 'barber'
AND `is_active` = 1
---
    public function getBarbers()
    {
        return $this->where('role', 'barber')
            ->where('is_active', 1)
            ->findAll();